app/views/lists/index.html.erb

SELECT "lists".* FROM "lists"
SELECT "list_items".* FROM "list_items" WHERE "list_items"."list_id" = ?  [["list_id", 1]]
---
    <ul>
        <% list.list_items.each do |list_item| %>