app/views/lists/show.html.erb

    <ul>
        <% @list.list_items.each do |list_item| %>
---
SELECT "list_items".* FROM "list_items" WHERE "list_items"."list_id" = ?  [["list_id", 1]]