app/controllers/lists_controller.rb

  def create
    @list  = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Grilling 2"], ["created_at", "2018-10-01 22:15:59.203582"], ["updated_at", "2018-10-01 22:15:59.203582"]]