app/models/list.rb

    def items_attributes=(item_hash)
        byebug
        item_hash.value.each do |item|
            self.item = Item.find_or_create_by(name: item[:name])
---
INSERT INTO "items" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fish"], ["created_at", "2018-10-02 11:08:17.551380"], ["updated_at", "2018-10-02 11:08:17.551380"]]
SELECT  "items".* FROM "items" WHERE "items"."name" = ? LIMIT ?  [["name", "butter"], ["LIMIT", 1]]